# Titanic 예제 실습

In [6]:
# 모듈 로딩
import pandas as pd, os
import numpy as np

# 파일 관련 변수
DIR='../Data/'
FILE=DIR+'titanic.csv'

if os.path.exists(FILE):print('File OK')
else: print('File is not Exist')

File OK

In [7]:
titanic=pd.read_csv(FILE)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
# 범주형
titanic[['Survived','Pclass','Sex','Embarked']]=titanic[['Survived','Pclass','Sex','Embarked']].astype('category')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    category
dtypes: category(4), float64(2), int64(3), object(3)
memory usage: 59.8+ KB

In [11]:
# 생존율
print('생존율 : ',round((titanic['Survived']==1).sum()/len(titanic.index)*100,2),'%')

# # 사망률
# 1-(titanic['Survived']==1).sum()/len(titanic.index)

생존율 :  38.38 %

### 클래스별 생존율

In [12]:
titanic['Pclass'].unique()

[3, 1, 2]
Categories (3, int64): [1, 2, 3]

In [13]:
def classSur_class(num):
    print(f'{num}클래스 내의 생존율 :',
          round((((titanic['Pclass']==num) & (titanic['Survived']==1)).sum())/(titanic['Pclass']==num).sum()*100,2),
          '%')

In [14]:
for i in [1,2,3]:
    classSur_class(i)

1클래스 내의 생존율 : 62.96 %
2클래스 내의 생존율 : 47.28 %
3클래스 내의 생존율 : 24.24 %

In [15]:
# def classSur_en(num):
#     return (((titanic['Pclass']==num) & (titanic['Survived']==1)).sum())/891

def classSur_en(num):
    print(f'전 인원 중 {num}클래스 생존율 :',
          round((((titanic['Pclass']==num) & (titanic['Survived']==1)).sum())/891*100,2),
          '%')

In [16]:
for i in [1,2,3]:
   classSur_en(i)

전 인원 중 1클래스 생존율 : 15.26 %
전 인원 중 2클래스 생존율 : 9.76 %
전 인원 중 3클래스 생존율 : 13.36 %

### 성별 생존율

In [17]:
# 남자/전체
# round((((titanic['Sex']=='male') & (titanic['Survived']==1)).sum())/891*100,2)

In [18]:
# 여자/전체
# round((((titanic['Sex']=='female') & (titanic['Survived']==1)).sum())/891*100,2)

In [19]:
# 남자/남자전체
round((((titanic['Sex']=='male') & (titanic['Survived']==1)).sum())/(titanic['Sex']=='male').sum()*100,2)

18.89

In [20]:
# 여자/여자전체
round((((titanic['Sex']=='female') & (titanic['Survived']==1)).sum())/(titanic['Sex']=='female').sum()*100,2)

74.2

### 연령별 생존율

In [21]:
titanic['Age'].max(), titanic['Age'].min()

(80.0, 0.42)

In [22]:
titanic['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [23]:
titanic[titanic['Age']<1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S

In [24]:
(((titanic['Age']<10)&(titanic['Survived']==1)).sum()/(titanic['Age']<10).sum())*100

61.29032258064516

In [35]:
def ageSur(age1, age2):
    mina=titanic['Age']>=age1
    maxa=titanic['Age']<age2
    sur=titanic['Survived']==1
    print(f'{age1}~{age2}세 생존율({(mina&maxa).sum()}명 중 {(mina&maxa&sur).sum()}명) :'
          ,round(((mina&maxa&sur).sum()/(mina&maxa).sum())*100
        ,2),'%')

In [36]:
ageSur(0,10)

0~10세 생존율(62명 중 38명) : 61.29 %

In [38]:
for i in range(0,81,10):
    ageSur(i,i+10)

0~10세 생존율(62명 중 38명) : 61.29 %
10~20세 생존율(102명 중 41명) : 40.2 %
20~30세 생존율(220명 중 77명) : 35.0 %
30~40세 생존율(167명 중 73명) : 43.71 %
40~50세 생존율(89명 중 34명) : 38.2 %
50~60세 생존율(48명 중 20명) : 41.67 %
60~70세 생존율(19명 중 6명) : 31.58 %
70~80세 생존율(6명 중 0명) : 0.0 %
80~90세 생존율(1명 중 1명) : 100.0 %

6